app/controllers/store_controller.rb

	def show_now
		@tmpfilms = Film.find(:all, :conditions => ["time < ?", Time.now])
    @films = []
    @tmpfilms.each do |f|
---
SELECT "films".* FROM "films"